snlkuharlocal/src/DataProcessors/ФР_РегистрацияДляОбмена/ФР_РегистрацияДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФР_РегистрацияДляОбмена</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ФР_ОбъектыКВыгрузке/ФР_ОбъектыКВыгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФР_ОбъектыКВыгрузке</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборРС</name>
    <comment>Отбор регистра сведений</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаПриВыгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектСсылкаУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтборРС_Хэш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД_Пакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ФР_РегистрацияДляОбмена/Forms/ФормаЗапуска/Module.bsl
&НаКлиенте
Процедура УзелОбменаСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	//СтандартнаяОбработка = Ложь;
	//ТекИмяФормы = "Обработка.ФР_РегистрацияДляОбмена.Форма.ВыборУзлаПланаОбмена";
	//сообщить(ТекИмяФормы);
	//ТекПараметры = Новый Структура("МножественныйВыбор, НачальноеЗначениеВыбора",
	//	 Ложь, ПланыОбмена.ФР_ОбменСФР.Узел_ФранчБаза());
	////ФормаВыборУзла = ЭтотОбъект.ЭтаФорма.по
	//ОткрытьФорму(ТекИмяФормы, ТекПараметры, Элемент);
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФормы(ТекущийОбъект=Неопределено)
	Возврат ЭтотОбъект().ПолучитьИмяФормы(ТекущийОбъект);
КонецФункции

&НаСервере
Функция ЭтотОбъект(ТекущийОбъект=Неопределено) 
	Если ТекущийОбъект=Неопределено Тогда
		Возврат РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура УзелОбменаСсылкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	//Если УзелОбменаСсылка<>ВыбранноеЗначение Тогда
	//	УзелОбменаСсылка = ВыбранноеЗначение;
	//	ОбработкаВыбораУзлаОбмена();
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораУзлаОбмена()
	
	// Изменяем номера узлов в гиперссылке по редактированию
	//УстановитьЗаголовокНомеровСообщений();
	
	// Обновляем дерево метаданных
	ПрочитатьДеревоМетаданных();
	ЗаполнитьКоличествоРегистрацийВДереве();
	
	// Обновляем активную страницу
	ПоследняяАктивнаяКолонкаМетаданных = Неопределено;
	ПоследняяАктивнаяСтрокаМетаданных  = Неопределено;
	//Элементы.ВариантыСпискаОбъектов.ТекущаяСтраница = Элементы.СтраницаПустая;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДеревоМетаданных()
	Данные = ЭтотОбъект().СформироватьСтруктуруМетаданных(УзелОбменаСсылка);
	
	// Удаляем строки, которые нельзя редактировать
	МетаДерево = Данные.Дерево;
	Для Каждого ЭлементСписка Из ИменаСкрываемыхМетаданных Цикл
		УдалитьСтрокиДереваЗначенийМетаданных(ЭлементСписка.Значение, МетаДерево.Строки);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(МетаДерево, "ДеревоМетаданных");
	СтруктураАвторегистрацииМетаданных = Данные.СтруктураАвторегистрации;
	СтруктураПредставленийМетаданных   = Данные.СтруктураПредставлений;
	СтруктураИменМетаданных            = Данные.СтруктураИмен;
КонецПроцедуры

&НаСервере 
Процедура УдалитьСтрокиДереваЗначенийМетаданных(Знач МетаПолноеИмя, СтрокиДерева)
	Если ПустаяСтрока(МетаПолноеИмя) Тогда
		Возврат;
	КонецЕсли;
	
	// В текущем наборе
	Фильтр = Новый Структура("МетаПолноеИмя", МетаПолноеИмя);
	Для Каждого СтрокаУдаления Из СтрокиДерева.НайтиСтроки(Фильтр, Ложь) Цикл
		СтрокиДерева.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	// И из оставшихся иерархически
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		УдалитьСтрокиДереваЗначенийМетаданных(МетаПолноеИмя, СтрокаДерева.Строки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоРегистрацийВДереве()
	
	Данные = ЭтотОбъект().ПолучитьКоличествоИзменений(СтруктураИменМетаданных, УзелОбменаСсылка);
	
	// Проставляем в дерево
	Фильтр = Новый Структура("МетаПолноеИмя, УзелОбмена", Неопределено, УзелОбменаСсылка);
	Нули   = Новый Структура("КоличествоИзменений, КоличествоВыгруженных, КоличествоНеВыгруженных", 0,0,0);
	
	Для Каждого Корень Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		СуммаКорень = Новый Структура("КоличествоИзменений, КоличествоВыгруженных, КоличествоНеВыгруженных", 0,0,0);
		
		Для Каждого Группа Из Корень.ПолучитьЭлементы() Цикл
			СуммаГруппа = Новый Структура("КоличествоИзменений, КоличествоВыгруженных, КоличествоНеВыгруженных", 0,0,0);
			
			СписокУзлов = Группа.ПолучитьЭлементы();
			Если СписокУзлов.Количество()=0 И СтруктураИменМетаданных.Свойство(Группа.МетаПолноеИмя) Тогда
				// Коллекция узлов без узлов, просуммируем руками, авторегистрацию возьмем из структуры
				Для Каждого МетаИмя Из СтруктураИменМетаданных[Группа.МетаПолноеИмя] Цикл
					Фильтр.МетаПолноеИмя = МетаИмя;
					Найдено = Данные.НайтиСтроки(Фильтр);
					Если Найдено.Количество()>0 Тогда
						Строка = Найдено[0];
						СуммаГруппа.КоличествоИзменений     = СуммаГруппа.КоличествоИзменений     + Строка.КоличествоИзменений;
						СуммаГруппа.КоличествоВыгруженных   = СуммаГруппа.КоличествоВыгруженных   + Строка.КоличествоВыгруженных;
						СуммаГруппа.КоличествоНеВыгруженных = СуммаГруппа.КоличествоНеВыгруженных + Строка.КоличествоНеВыгруженных;
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				// Считаем по каждому узлу
				Для Каждого Узел Из СписокУзлов Цикл
					Фильтр.МетаПолноеИмя = Узел.МетаПолноеИмя;
					Найдено = Данные.НайтиСтроки(Фильтр);
					Если Найдено.Количество()>0 Тогда
						Строка = Найдено[0];
						ЗаполнитьЗначенияСвойств(Узел, Строка, "КоличествоИзменений, КоличествоВыгруженных, КоличествоНеВыгруженных");
						СуммаГруппа.КоличествоИзменений     = СуммаГруппа.КоличествоИзменений     + Строка.КоличествоИзменений;
						СуммаГруппа.КоличествоВыгруженных   = СуммаГруппа.КоличествоВыгруженных   + Строка.КоличествоВыгруженных;
						СуммаГруппа.КоличествоНеВыгруженных = СуммаГруппа.КоличествоНеВыгруженных + Строка.КоличествоНеВыгруженных;
					Иначе
						ЗаполнитьЗначенияСвойств(Узел, Нули);
					КонецЕсли;
					
					ФорматироватьКоличествоИзменений(Узел);
				КонецЦикла;
				
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Группа, СуммаГруппа);
			
			СуммаКорень.КоличествоИзменений     = СуммаКорень.КоличествоИзменений     + Группа.КоличествоИзменений;
			СуммаКорень.КоличествоВыгруженных   = СуммаКорень.КоличествоВыгруженных   + Группа.КоличествоВыгруженных;
			СуммаКорень.КоличествоНеВыгруженных = СуммаКорень.КоличествоНеВыгруженных + Группа.КоличествоНеВыгруженных;
			
			ФорматироватьКоличествоИзменений(Группа);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(Корень, СуммаКорень);
		
		ФорматироватьКоличествоИзменений(Корень);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ФорматироватьКоличествоИзменений(Строка)
	Строка.КоличествоИзмененийСтрокой = Формат(Строка.КоличествоИзменений, "ЧН=") + " / " + Формат(Строка.КоличествоНеВыгруженных, "ЧН=");
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоМетаданных()
	Для Каждого Строка Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		Элементы.ДеревоМетаданных.Развернуть( Строка.ПолучитьИдентификатор() );
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВариантыСпискаОбъектовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// Вставить содержимое обработчика.
	//ОбновитьСодержимоеСтраницы(ТекущаяСтраница);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	//ПланОбменаИмя = "ФР_ОбменСФР";
	//ВыборУзлов = ПланыОбмена[ПланОбменаИмя].Выбрать();
	//Пока ВыборУзлов.Следующий() Цикл
	//	Если НЕ ВыборУзлов.ЭтотУзел Тогда
	//		УзелОбменаСсылка = ВыборУзлов.Ссылка;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//сообщить(УзелОбменаСсылка.Метаданные().Имя);
	//КолЭл = МетаДанные.ПланыОбмена.ФР_ОбменСФР.Состав.Количество();
	//нн = 0;
	//
	////Пока нн < КолЭл Цикл
	////	ТЭл =  МетаДанные.ПланыОбмена.ФР_ОбменСФР.Состав.
	////	нн = нн + 1;
	//
	//ЗаполнитьДерево(ПланОбменаИмя);
	////Для Каждого ТТип Из МассивТип Цикл
	////	ТСтр=ДеревоМета.Строки.Добавить();
	////	ТСтр.Объект=ТТип;
	////	Найды = ТЗМета.НайтиСтроки(Новый Структура("ТипОбъекта", ТТип));
	////	Для Каждого Найд Из Найды Цикл
	////		МСтр=ТСтр.Строки.Добавить();
	////		МСтр.Объект=Найд.Объект;
	////	КонецЦикла;
	////КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыделитьТип(ИмяТипа)
	ПозТ = СтрНайти(ИмяТипа, ".");
	Возврат Новый Структура("ТипОб, ИмяОб", ?(ПозТ, Лев(ИмяТипа, ПозТ - 1), ИмяТипа), ?(ПозТ, Сред(ИмяТипа, ПозТ + 1), ИмяТипа));
КонецФункции

&НаСервере
Процедура ЗаполнитьДерево(ПланОбменаИмя)
	//заполнение списка объектов метаданных на сервере
	МассивТип = Новый Массив;
	ТЗМета.Очистить();
	Для Каждого ТЭл Из МетаДанные.ПланыОбмена[ПланОбменаИмя].Состав Цикл
		НовСтр = ТЗМета.Добавить();
		НовСтр.Имя = СокрЛП(ТЭл.Метаданные.ПолноеИмя());
		НовСтр.ТипОбъекта = ВыделитьТип(НовСтр.Имя).ТипОб;
		НовСтр.Объект = ВыделитьТип(НовСтр.Имя).ИмяОб;
		Если МассивТип.Найти(НовСтр.ТипОбъекта) = Неопределено Тогда
			 МассивТип.Добавить(НовСтр.ТипОбъекта);
		КонецЕсли;
	КонецЦикла;
	ДЗ=Новый ДеревоЗначений;
	ДЗ.Колонки.Добавить("Объект");
	Для Каждого ТТип Из МассивТип Цикл
		ТСтр=ДЗ.Строки.Добавить();
		ТСтр.Объект=ТТип;
		Найды = ТЗМета.НайтиСтроки(Новый Структура("ТипОбъекта", ТТип));
		Для Каждого Найд Из Найды Цикл
			МСтр=ТСтр.Строки.Добавить();
			МСтр.Объект=Найд.Объект;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДЗ, "ДеревоМета");
КонецПроцедуры


&НаСервере
Процедура УзелОбменаСсылкаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	ПланОбменаИмя = УзелОбменаСсылка.Метаданные().Имя;
		
	ЗаполнитьДерево(ПланОбменаИмя);
КонецПроцедуры


&НаКлиенте
Процедура УзелОбменаСсылкаПриИзменении(Элемент)
	УзелОбменаСсылкаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ДеревоМетаПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	ТЗРегистрат.Очистить();
	
	//Элементы.Группа3.Заголовок = "Зарегистрировано к обмену";
	Раздел = "";
	ОбъектК = "";
	ОбъектТип = "";
	Попытка
		Раздел=Строка(Элементы.ДеревоМета.ТекущиеДанные.ПолучитьРодителя().Объект);
		ОбъектК=Строка(Элементы.ДеревоМета.ТекущиеДанные.Объект);
		Если ЗначениеЗаполнено(Раздел) Тогда
			ОбъектТип = Раздел + "." + ОбъектК;
			ЗаполнитьТЗРег(ОбъектТип);
		КонецЕсли;
	Исключение
		
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЗРег(ОбъектТип)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыКВыгрузке.ОбъектСсылкаУИД КАК ОбъектСсылкаУИД,
	|	ОбъектыКВыгрузке.ИД_Пакета КАК ИД_Пакета,
	|	ОбъектыКВыгрузке.ВариантВыгрузки КАК ВариантВыгрузки,
	|	ОбъектыКВыгрузке.Получатель КАК Получатель,
	|	ОбъектыКВыгрузке.ОбъектТип КАК ОбъектТип
	|ИЗ
	|	РегистрСведений.ФР_ОбъектыКВыгрузке КАК ОбъектыКВыгрузке
	|ГДЕ
	|	ОбъектыКВыгрузке.ОбъектТип = &ОбъектТип
	//|	И ОбъектыКВыгрузке.Получатель = &Получатель
	//|ОБЪЕДИНИТЬ
	//|ВЫБРАТЬ
	//|	ОбъектыСИзменениями.ОбъектСсылкаУИД,
	//|	ОбъектыСИзменениями.ИД_Пакета,
	//|	ОбъектыСИзменениями.ВариантВыгрузки,
	//|	&Получатель,
	////|	ОбъектыСИзменениями.Получатель,
	//|	ОбъектыСИзменениями.ОбъектТип
	//|ИЗ
	//|	РегистрСведений.ОбъектыСИзменениями КАК ОбъектыСИзменениями
	//|ГДЕ
	//|	ОбъектыСИзменениями.ОбъектТип = &ОбъектТип
	|";
	//Запрос.УстановитьПараметр("Получатель", УзелОбменаСсылка.Код);
	Запрос.УстановитьПараметр("ОбъектТип", ОбъектТип);
	ТЗРегистрат.Загрузить(Запрос.Выполнить().Выгрузить());
	//Сообщить(ТЗРегистрат.Количество());
	//Элементы.КолвоРег.Заголовок = "Зарегистрировано к обмену " + Формат(ТЗРегистрат.Количество(), "ЧН=0; ЧГ=3,0"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРегистрацию(Команда)
	// Вставить содержимое обработчика.
	Попытка
		Если ЗначениеЗаполнено(ОбъектТип) Тогда
			Если НРег(Лев(ОбъектТип,7)) = "регистр" Тогда
				ПоказатьПредупреждение(, "Не предусмотрена регистрация для этого типа объекта " + ОбъектТип + " и узла " + Строка(УзелОбменаСсылка));
				Возврат;
			КонецЕсли;
			ОповещениеВыбран = Новый ОписаниеОповещения("ВыборЭлемента", ЭтаФорма);
			ПараметрыФормы = Новый Структура("ОсновнаяТаблица, ТекстЗапроса", ОбъектТип, "ВЫБРАТЬ * ИЗ " + ОбъектТип );
			Если НРег(Лев(ОбъектТип,7)) = "регистр" Тогда
				//ОткрытьФорму("РегистрСведений.История.ФормаСписка"
				ОткрытьФорму("Обработка.ФР_РегистрацияДляОбмена.Форма.ФормаВыборР", ПараметрыФормы, ЭтаФорма,,,, ОповещениеВыбран, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				//ОткрытьФорму("Обработка.ФР_РегистрацияДляОбмена.Форма.ВыборРегистр",ПараметрыФормы, ЭтаФорма,,,, ОповещениеВыбран, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ОткрытьФорму("Обработка.ФР_РегистрацияДляОбмена.Форма.ВыборПроизвольный",ПараметрыФормы, ЭтаФорма,,,, ОповещениеВыбран, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
		КонецЕсли;
		
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЭлемента(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	//Сообщить("ВыбранноеЗначение " + строка(ВыбранноеЗначение));
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		РезДоб = ДобавитьРегистрациюВЗ(ВыбранноеЗначение);
		ТекстПред = "Регистрация не выполнена";
		Если РезДоб = 1 Тогда
			ТекстПред = "Выбранный элемент уже зарегистрирован";
		ИначеЕсли РезДоб = 2 Тогда
			ТекстПред = "Не удалось зарегистрировать выбранные элементы";
		ИначеЕсли РезДоб = 3 Тогда
			ТекстПред = "Выбранные элементы добавлены к регистрации";
			
		ИначеЕсли РезДоб = 5 Тогда
			ТекстПред = "Выбранные элементы частично добавлены к регистрации";
		ИначеЕсли РезДоб = 4 Тогда
			ТекстПред = "Ошибка при выполнении регистрации";
		КонецЕсли;	
		ПоказатьПредупреждение(,ТекстПред);
	Иначе
		ПоказатьПредупреждение(,"Не выбрано значение для добавления");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьРегистрациюВЗ(ВыбранноеЗначение)
	Рез = 0;
	Попытка
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
			//регистр
			СтрХран = Новый Структура;
			
			Если НРег(Лев(ОбъектТип,15)) = "регистрсведений" Тогда
		        Сообщить("Регистрация не выполнена - запрет режима для регистров сведений");
				//Для Каждого ВыбрЗнач Из ВыбранноеЗначение Цикл
				//	Попытка
				//		ИмяРег = Сред(ОбъектТип, 17);
				//		Представ = ОбъектТип ;
				//		Для Каждого КлЗ Из ВыбрЗнач Цикл
				//			
				//			Если НЕ Метаданные.РегистрыСведений[ИмяРег].Измерения.Найти(Клз.Ключ) = Неопределено Тогда
				//				Представ = Представ + " " + СокрЛП(Клз.Ключ) + " " + СокрЛП(КлЗ.Значение);
				//				
				//			КонецЕсли;
				//			ТипМета = "";
				//			Попытка
				//				ТипМета = КлЗ.Значение.Метаданные().ПолноеИмя();
				//			Исключение
				//			КонецПопытки;
				//			
				//			//Объект Номенклатура тип м Справочник.Номенклатура
				//			УИД = "";
				//			Если НЕ ПустаяСтрока(ТипМета) Тогда
				//				Если (СтрНайти(ТипМета, "Справочник") > 0) ИЛИ (СтрНайти(ТипМета, "Документ") > 0) ИЛИ (СтрНайти(ТипМета, "Перечисление") > 0) Тогда
				//					УИД = XMLСтрока(КлЗ.Значение);
				//				КонецЕсли;	
				//			КонецЕсли;
				//			СтрХран.Вставить(СокрЛП(Клз.Ключ), Новый Структура("ТипЗнач, ТипМета, Значен, УИД", Строка(ТипЗнч(КлЗ.Значение)), ТипМета, СокрЛП(КлЗ.Значение), УИД)); 
				//		КонецЦикла;
				//		НовУИД = Новый УникальныйИдентификатор;
				//		МенЗап = РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьМенеджерЗаписи();
				//		//МенЗап.Получатель = УзелОбменаСсылка.Код;
				//		МенЗап.ОбъектТип = ОбъектТип;
				//		ВариантВыгрузки = "РегистрМенеджер";
				//		МенЗап.ВариантВыгрузки = ВариантВыгрузки;
				//		МенЗап.ИД_Пакета = НовУИД;
				//		МенЗап.ОбъектСсылкаУИД = НовУИД;
				//		МенЗап.ДатаРегистрации = ТекущаяДатаСеанса();
				//		МенЗап.ПредставлениеОбъекта = СокрЛП(Представ);
				//		МенЗап.ОтборРС_Хэш = "";
				//		МенЗап.ОтборРС = Новый ХранилищеЗначения(ПолучитьJSON(СтрХран));  
				//		МенЗап.Номер = 1;
				//		МенЗап.Записать();
				//	Исключение
				//		Сообщить(ОписаниеОшибки());
				//	КонецПопытки;
				//	Рез = 3;
				//КонецЦикла;
				//ЗаполнитьТЗРег(ОбъектТип);
			Иначе
				СчтРег = 0;
				СчтРегУсп = 0;
				Для Каждого ВыбрЗнач Из  ВыбранноеЗначение Цикл
					Рег = РегистрыСведений.ФР_ОбъектыКВыгрузке.ЗарегистрироватьОбъект(ВыбрЗнач);
					СчтРег = СчтРег + 1;
					//сообщить(Строка(ВыбрЗнач) + " " + строка(Рег.Результат));
					//Результат			= Новый Структура("Результат,Ошибки
					Если Рег.Результат Тогда
						СчтРегУсп = СчтРегУсп + 1;
					КонецЕсли;
				КонецЦикла;
				Рез = ?(СчтРегУсп = СчтРег, 3, ?(СчтРегУсп, 5, 2));
				ЗаполнитьТЗРег(ОбъектТип);
				
			КонецЕсли;
	
			
		КонецЕсли;
	Исключение
		Рез = 4;
		Сообщить("Ошибка при регистрации объекта " + ОписаниеОшибки()); 
	КонецПопытки;
	Возврат Рез;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьJSON(СтрРезультат) Экспорт
	джЗапись = Новый ЗаписьJSON;
	джЗапись.УстановитьСтроку();
	ЗаписатьJSON(джЗапись, СтрРезультат);
	Возврат джЗапись.Закрыть();
КонецФункции

&НаСервере
Процедура УдалитьВсюРегистрациюНаСервере()
	// Вставить содержимое обработчика.
	НаборОВ = РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьНаборЗаписей();
	НаборОВ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсюРегистрацию(Команда)
	РезультатВопроса = Вопрос("Уверены, что хотите удалить все зарегистрированные к выгрузке объекты?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьВсюРегистрациюНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьРегистрациюПоТипуОбъектаНаСервере()
	// Вставить содержимое обработчика.
	НаборОВ = РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьНаборЗаписей();
	НаборОВ.Отбор.ОбъектТип.Установить(ОбъектТип);
	НаборОВ.Прочитать();
	НаборОВ.Очистить();
	НаборОВ.Записать();
	ЗаполнитьТЗРег(ОбъектТип);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегистрациюПоТипуОбъекта(Команда)
	РезультатВопроса = Вопрос("Уверены, что хотите удалить все зарегистрированные к выгрузке объекты " + ОбъектТип +"?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьРегистрациюПоТипуОбъектаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьТекущуюСтрокуНаСервере(ОбъектСсылкаУИД)
	// Вставить содержимое обработчика.
	НаборОВ = РегистрыСведений.ФР_ОбъектыКВыгрузке.СоздатьНаборЗаписей();
	НаборОВ.Отбор.ОбъектТип.Установить(ОбъектТип);
	НаборОВ.Отбор.ОбъектСсылкаУИД.Установить(ОбъектСсылкаУИД);
	НаборОВ.Прочитать();
	НаборОВ.Очистить();
	НаборОВ.Записать();
	ЗаполнитьТЗРег(ОбъектТип);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТекущуюСтроку(Команда)
	Если Элементы.ТЗРегистрат.ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(,"Не выбрана строка");
		Возврат;
	КонецЕсли;
	РезультатВопроса = Вопрос("Уверены, что хотите удалить текущую строку регистрации?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьТекущуюСтрокуНаСервере(Элементы.ТЗРегистрат.ТекущиеДанные.ОбъектСсылкаУИД);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	// Вставить содержимое обработчика. 
	сообщить(ПараметрыСеанса.ЭтотУзел.Код);
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
